import React from "react";
import "./services.css";

const services = [
  { title: "जीपीडीपी (GPDP)", desc: "आर्थिक विकास आणि सामाजिक न्यायासाठी पंचायत विकास योजना (पीडीपी) तयार करणे." },
  { title: "वायब्रंट ग्राम सभा", desc: "ग्राम पंचायत / ग्राम स्तरावर महत्त्वाच्या क्षेत्रांमध्ये घेतलेल्या निर्णयांचे आणि आदेशांचे निरीक्षण करणे." },
  { title: "ई-ग्राम स्वराज", desc: "याचा उद्देश केंद्रीकृत नियोजन, प्रगती अहवाल आणि कामावर आधारित लेखा प्रणालीमध्ये पारदर्शकता आणणे आहे." },
  { title: "ऑडिट ऑनलाइन", desc: "ही सरकारी सेवा पंचायत राज संस्थांच्या अंतर्गत आणि बाह्य लेखापरीक्षणासाठी सुविधा उपलब्ध करून देते." },
  { title: "स्थानिक शासनाची मार्गदर्शिका", desc: "याचा उद्देश स्थानिक प्रशासनाचे कार्यप्रदर्शन आणि कार्यक्षमता कायम ठेवणे आहे." },
  { title: "सर्विस प्लस", desc: "सर्विस प्लस हा नागरिकांना ई-सेवा प्रदान करण्यासाठी तयार केलेला एक ई-सेवा वितरण मंच आहे." },
  { title: "आरजीएसए (RGSA)", desc: "पंचायती राज संस्थांची क्षमता वाढवणे, विकास आणि बळकटीकरण करणे." },
  { title: " टीएमपी (TMP)", desc: "टीएमपी ही सरकारी संस्थांच्या प्रशिक्षण आणि व्यवस्थापनाच्या गरजा पूर्ण करण्यासाठी तयार केलेली प्रणाली आहे." },
  { title: " पंचायत पुरस्कार", desc: "देशभरातील उत्कृष्ट कामगिरी करणाऱ्या पंचायतांना दिले जाणारे पुरस्कार." },
  { title: "स्वामित्व", desc: "ग्राम क्षेत्रातील मालमत्तेचे सर्वेक्षण करून आधुनिक तंत्रज्ञानाच्या साहाय्याने नकाशे / मॅपिंग करणे." },
  { title: "स्थानिक योजना", desc: "राज्ये आणि पंचायतांनी स्वीकारण्यासाठी एक सामान्य मास्टर प्लॅन तयार करणे." },
  { title: "भारत@75", desc: "आझादी का अमृत महोत्सव – भारत सरकारचा एक उपक्रम." }
];

const OnlineServices = () => {
  return (
    <section className="services-section">
      <div className="container">
      <h2 className="section-title">ऑनलाइन सेवा व पोर्टल्स</h2>

      <div className="services-grid">
        {services.map((service, index) => (
          <div key={index} className="service-card">
            <h3>{service.title}</h3>
            <p>{service.desc}</p>
          </div>
        ))}
      </div>
      </div>
    </section>
  );
};

export default OnlineServices;