// menu.js
export const menuItems = [
  { name: "मुख्यपृष्ठ", path: "/" },

  {
    name: "विभागविषयी",
    path: "/विभागाविषयी",
    submenu: [
      { name: "पंचायत समिती विषयी", path: "/विभागाविषयी/पंचायत-समिती-विषयी" },
      { name: "दृष्टी आणि ध्येय", path: "/विभागाविषयी/दृष्टी-आणि-ध्येय" },
      { name: "उद्दिष्टे आणि कार्ये", path: "/विभागाविषयी/उद्दिष्टे-आणि-कार्ये" },
      { name: "प्रशासकीय रचना", path: "/विभागाविषयी/प्रशासकीय-रचना" },
    ],
  },

  {
    name: "विभाग",
    path: "/विभाग",
    submenu: [
      { name: "सामान्य प्रशासन विभाग", path: "/विभाग/सामान्य-प्रशासन-विभाग" },
      { name: "ग्रामपंचायत विभाग", path: "/विभाग/ग्रामपंचायत-विभाग" },
      {
        name: "शिक्षण विभाग",
        path: "/शिक्षण-विभाग",
        submenu: [
          { name: "प्राथमिक शिक्षण", path: "/विभाग/शिक्षण-विभाग/प्राथमिक-शिक्षण" },
          { name: "माध्यमिक शिक्षण", path: "/विभाग/शिक्षण-विभाग/माध्यमिक-शिक्षण" },
        ],
      },
      { name: "जिल्हा ग्रामीण विकास यंत्रणा", path: "/विभाग/जिल्हा-ग्रामीण-विकास-यंत्रणा" },
      { name: "वित्त विभाग", path: "/विभाग/वित्त-विभाग" },
      { name: "समाज कल्याण विभाग", path: "/विभाग/समाज-कल्याण-विभाग" },
      { name: "पशुसंवर्धन विभाग", path: "/विभाग/पशुसंवर्धन-विभाग" },
      { name: "कृषी विभाग", path: "/विभाग/कृषी-विभाग" },
      { name: "ग्रामीण पाणी पुरवठा व बांधकाम विभाग", path: "/विभाग/ग्रामीण-पाणी-पुरवठा-बांधकाम-विभाग" },
      {
        name: "बांधकाम विभाग",
        path: "/बांधकाम-विभाग",
        submenu: [
          { name: "बांधकाम विभाग - उत्तर", path: "/विभाग/बांधकाम-विभाग/बांधकाम-विभाग-उत्तर" },
          { name: "बांधकाम विभाग - दक्षिण", path: "/विभाग/बांधकाम-विभाग/बांधकाम-विभाग-दक्षिण" },
        ],
      },
      { name: "आरोग्य विभाग", path: "/विभाग/आरोग्य-विभाग" },
      { name: "जिल्हा पाणी व स्वच्छता मिशन", path: "/विभाग/जिल्हा-पाणी-व-स्वच्छता-मिशन" },
      { name: "जिल्हा परिषद विभाग", path: "/विभाग/जिल्हा-परिषद-विभाग" },
    ],
  },

  { name: "निर्देशिका", path: "/निर्देशिका" },

  {
    name: "नागरिकांचा विषयी",
    path: "/नागरिकांचा-विषयी",
    submenu: [
      { name: "तक्रार निवारण", path: "/नागरिकांचा-विषयी/तक्रार-निवारण" },
      { name: "लोकसेवा हक्‍क", path: "/नागरिकांचा-विषयी/lokseva-hakk" },
    ],
  },

  {
    name: "योजना/कार्यक्रम",
    path: "/योजना-कार्यक्रम",
    submenu: [
      { name: "राज्य सरकार", path: "/योजना/राज्य-सरकार" },
      { name: "केंद्र पुरस्कृत", path: "/योजना/केंद्र-पुरस्कृत" },
    ],
  },

  {
    name: "कागदपत्रे",
    path: "/कागदपत्रे",
    submenu: [
      { name: "परिपत्रके / सूचना", path: "/कागदपत्रे/परिपत्रके-सूचना" },
      { name: "कायदे व अधिनियम", path: "/कागदपत्रे/कायदे-व-अधिनियम" },
      { name: "नागरिकांची सनद", path: "/कागदपत्रे/नागरिकांची-सनद" },
      { name: "सार्वजनिक सुट्टी २०२६", path: "/कागदपत्रे/सार्वजनिक-सुट्टी-२०२६" },
      { name: "जिल्हा परिषद अर्थसंकल्प २०२५-२६", path: "/कागदपत्रे/जिल्हा-परिषद-अर्थसंकल्प-२०२५-२६" },
      { name: "ज्येष्ठता यादी", path: "/कागदपत्रे/ज्येष्ठता-यादी" },
    ],
  },

  {
    name: "मीडिया कॉर्नर",
    path: "/मीडिया-कॉर्नर",
    submenu: [
      { name: "छायाचित्र दालन", path: "/मीडिया/छायाचित्र-दालन" },
      { name: "प्रिंट मीडिया", path: "/मीडिया/प्रिंट-मीडिया" },
    ],
  },

  {
    name: "माहितीचा अधिकार",
    path: "/माहितीचा-अधिकार",
    submenu: [
      { name: "माहितीचा अधिकार कागदपत्रे", path: "/माहिती-अधिकार/माहितीचा-अधिकार-कागदपत्रे" },
      { name: "माहितीचा अधिकार संपर्क", path: "/माहिती-अधिकार/माहितीचा-अधिकार-संपर्क" },
      { name: "ऑनलाईन माहितीचा अधिकार पोर्टल", path: "/माहिती-अधिकार/ऑनलाईन-माहितीचा अधिकार-पोर्टल" },
    ],
  },
];